test/performance/e-bambi-load-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">200</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8181</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer eyJhbGciOiJSUzI1NiIsInR5cCIgOiAiSldUIiwia2lkIiA6ICJJZk42S3RQWlhHTmp2MjFwa1FiTGZoczlkUWxKUHptdllRNzZuME55akY4In0.eyJleHAiOjE3NTMxMTYxMzYsImlhdCI6MTc1MzExNTgzNiwiYXV0aF90aW1lIjoxNzUzMTE1ODM2LCJqdGkiOiJvbnJ0YWM6YjJhMGMwNzktNWY5Zi00MGZiLTgwNDctNmQxYTBiMzNhM2MyIiwiaXNzIjoiaHR0cDovL2xvY2FsaG9zdDo4MDgxL3JlYWxtcy9iYW1iaSIsInN1YiI6IjkwMzExZDJiLTgyNWEtNDlhNS04YTAwLTAzNDI2YmE2OTAxNSIsInR5cCI6IkJlYXJlciIsImF6cCI6ImUtYmFtYmkiLCJzaWQiOiJlYzZkZWVlMi03NWNkLTQyNTgtYWMzYS1lOWZmNGNlMTM3YjMiLCJhY3IiOiIxIiwicmVhbG1fYWNjZXNzIjp7InJvbGVzIjpbIlVTRVIiXX0sInNjb3BlIjoiZW1haWwgcHJvZmlsZSIsImVtYWlsX3ZlcmlmaWVkIjpmYWxzZSwibmFtZSI6IlVzZXIgQmFtYmkiLCJwcmVmZXJyZWRfdXNlcm5hbWUiOiJlLWJhbWJpLXVzZXIiLCJnaXZlbl9uYW1lIjoiVXNlciIsImZhbWlseV9uYW1lIjoiQmFtYmkiLCJlbWFpbCI6ImUtYmFtYmktdXNlckB5b3VyLWRvbWFpbi5jb20ifQ.uh5ylGXaxesmCDMAIVuxGFNutX8EzxuP1JMZL77B7PjVEuogyWGfMtI48JO13fnXvCbr3rKi-rbSGJmYO2zTAfsNilEfQmKwocLbXRDNGoAjS538D3QRWlqLXVzEV9Z_nK2G97KL_UPtUS4JJOOshl0YYnPCWFisbmoAWtBHLRVQ2pkVYTvdYUmJMYBHS6D9pnac45-HoLPVPGEy0lTWWM0blH_yHLoA5EjShBnCXwnvxtFQqVl0fzJ5SgzMw9XwDdsGRwBOt3cmAyX4862IIgzuWO9rjASfoizlSKNvUHitp6AIAJLrTkB80YkgkV22t9RAYM8nfKEs2uNmDV3EQw </stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create order">
          <stringProp name="HTTPSampler.path">/api/v1/me/orders</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;paymentMethod&quot;: {&#xd;
    &quot;id&quot;: &quot;3fdc42b4-8341-43a4-aa78-c9fa792d4d9e&quot;,&#xd;
    &quot;name&quot;: &quot;PayPal&quot;&#xd;
  },&#xd;
  &quot;address&quot;: {&#xd;
    &quot;country&quot;: &quot;Spain&quot;,&#xd;
    &quot;address&quot;: &quot;Calle Gran Vía, 28&quot;,&#xd;
    &quot;city&quot;: &quot;Madrid&quot;,&#xd;
    &quot;province&quot;: &quot;Madrid&quot;,&#xd;
    &quot;postalCode&quot;: &quot;28013&quot;,&#xd;
    &quot;phoneNumber&quot;: &quot;+34 912 34 56 78&quot;&#xd;
  },&#xd;
  &quot;items&quot;: [&#xd;
    {&#xd;
      &quot;imageUrl&quot;: &quot;https://example.com/images/productos/camiseta-deportiva.jpg&quot;,&#xd;
      &quot;supplier&quot;: {&#xd;
        &quot;id&quot;: &quot;0d95b4c4-a138-4e6a-9d86-4c27ea98a83c&quot;,&#xd;
        &quot;name&quot;: &quot;Bambi&quot;&#xd;
      },&#xd;
      &quot;product&quot;: {&#xd;
        &quot;id&quot;: &quot;839546df-e9ab-45c4-b5e0-06f10ca5c3d7&quot;,&#xd;
        &quot;sku&quot;: &quot;SAM-001-EL&quot;,&#xd;
        &quot;name&quot;: &quot;Samsung Galaxy S23&quot;&#xd;
      },&#xd;
      &quot;price&quot;: 789.99,&#xd;
      &quot;quantity&quot;: 1,&#xd;
      &quot;totalPrice&quot;: 789.99&#xd;
    }&#xd;
  ],&#xd;
  &quot;totalPrice&quot;: 789.99&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">orderId</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$..id</stringProp>
            <stringProp name="Sample.scope">all</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>
        <WhileController guiclass="WhileControllerGui" testclass="WhileController" testname="While Controller" enabled="true">
          <stringProp name="WhileController.condition">${__javaScript(&quot;${orderStatus}&quot; != &quot;CREATED&quot; &amp;&amp; &quot;${orderStatus}&quot; != &quot;CANCELLED&quot;)}</stringProp>
        </WhileController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Get order result" enabled="true">
            <stringProp name="HTTPSampler.path">/api/v1/me/orders/${orderId}/tracking</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="true">
              <stringProp name="JSONPostProcessor.referenceNames">orderStatus</stringProp>
              <stringProp name="JSONPostProcessor.jsonPathExprs">$..orderStatus</stringProp>
            </JSONPostProcessor>
            <hashTree/>
          </hashTree>
        </hashTree>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>